Revit 2026 API

# DocumentIsDetached Property

---

Identifies if a workshared document is detached. Also, see IsWorkshared

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsDetached { get; }
```
```vb
Public ReadOnly Property IsDetached As Boolean
	Get
```
```cpp
public:
property bool IsDetached {
	bool get ();
}
```
```fsharp
member IsDetached : bool with get
```

#### Property Value

Boolean

Note that Title and PathName will be empty strings if a document is detached.

#### Reference

Document Class

Autodesk.Revit.DB Namespace